/********************************************************************************
 * @file test01.cc
 * @author lxy (2305195328@qq.com)
 * @brief 求阶乘(递归)
 * @version 1.0.0
 * @date 2022-11-24
 ********************************************************************************/
#include <iostream>
using namespace std;

/********************************************************************************
 * @brief 给一个整数求他的阶乘
 * 
 * @param  _arg             
 * @return int              
 ********************************************************************************/
int func(int _arg)
{
    if(_arg == 1)   //递归尾
        return 1;
    //? 只要知道_arg-1的阶乘值为多少,再把这个值乘_arg
    //? 就是我们要求的值
    return func(_arg - 1) * _arg;  
}

int main(int argc, char **argv)
{
    cout << func(9) << endl;
    return 0;
}